---
title: DuctFittingAndAccessoryConnectorData
classe: Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# DuctFittingAndAccessoryConnectorData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Angle { get; }` | `ductFittingAndAccessoryConnectorData.Angle` | Double |
| `Double Diameter { get; }` | `ductFittingAndAccessoryConnectorData.Diameter` | Double |
| `Double Flow { get; }` | `ductFittingAndAccessoryConnectorData.Flow` | Double |
| `FlowDirectionType FlowDirection { get; }` | `ductFittingAndAccessoryConnectorData.FlowDirection` | FlowDirectionType |
| `Double Height { get; }` | `ductFittingAndAccessoryConnectorData.Height` | Double |
| `Int32 Index { get; }` | `ductFittingAndAccessoryConnectorData.Index` | Int32 |
| `Boolean IsValidObject { get; }` | `ductFittingAndAccessoryConnectorData.IsValidObject` | Boolean |
| `Int32 LinkIndex { get; }` | `ductFittingAndAccessoryConnectorData.LinkIndex` | Int32 |
| `ConnectorProfileType Profile { get; }` | `ductFittingAndAccessoryConnectorData.Profile` | ConnectorProfileType |
| `Double VelocityPressure { get; }` | `ductFittingAndAccessoryConnectorData.VelocityPressure` | Double |
| `Double Width { get; }` | `ductFittingAndAccessoryConnectorData.Width` | Double |
| `Void Dispose()` | `ductFittingAndAccessoryConnectorData.Dispose()` | Void |
| `Transform GetCoordination()` | `ductFittingAndAccessoryConnectorData.GetCoordination()` | Transform |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```